#+title:  Chapter 4
#+author: Reinhard Stahn
#+setupfile: ./inc/setupfile.org
#+include: ./inc/latex-macros.org
#+property: header-args:python :session *chapter-4* :tangle chapter_4.py

#+toc: headlines 2

*** Proof
It is easy to see that $T = \exp(i\pi/8) \cdot R_z(\pi/4)$. We let ~sympy~ do the job:

#+name: exercise-4.3-1
#+begin_src python :tangle no :results replace :cache yes
  rz = Rz.subs(theta, pi/4)
  exp(I*pi/8) * rz - T  # should be zero
#+end_src

#+RESULTS[05d5cdbc180cef245309e9c98b210c052ce7c69c]: exercise-4.3-1
: Matrix([[0, 0], [0, 0]])

QED.

*** Solution
Clearly a mere product of two factors can't produce the Hadamard gate. Hence we try to
find $\alpha,\beta,\gamma$ such that $R_z(\alpha)\cdot R_x(\gamma) \cdot R_z(\beta)$ is the Hadamard
up to the phase factor. Due to the sqrt of 2 factor appearing in $H$ we deduce that $\gamma=\pm\pi/2$
is a good bet. Knowing what comes we choose $\gamma=\pi/2$.

#+name: exercise-4.4-1
#+begin_src python :tangle no
  a, b = sp.symbols('\\alpha \\beta')

  ra = Rz.subs(theta, a)
  rb = Rz.subs(theta, b)
  rx = Rx.subs(theta, pi/2)

  h0 = ra * rx * rb
#+end_src

A short calculation leads to (use the code above to do it):

#+name: exercise-4.4-2
#+begin_src python :results value latex replace :exports none :cache yes :tangle no
  simp = sp.simplify(sqrt(2)*h0)
  latex_formula = sp.latex(simp)
  #sp.preview(simp, viewer='file', filename='output.png', euler=False,
  #           dvioptions=['-D', '200', '-T', 'tight', '-bg', 'Transparent', '-fg', 'rgb 0.2 0.6 1.0'])
  #"output.png"

  latex_formula
#+end_src

#+RESULTS[4cc17962fa3ae28f5b520b6994b68c6032369202]: exercise-4.4-2
#+begin_export latex
\left[\begin{matrix}e^{\frac{i \left(- \alpha - \beta\right)}{2}} & - i e^{- \frac{i \left(\alpha - \beta\right)}{2}}\\- i e^{\frac{i \left(\alpha - \beta\right)}{2}} & e^{\frac{i \left(\alpha + \beta\right)}{2}}\end{matrix}\right]
#+end_export

# RHS is result above
$$
R_z(\alpha)\cdot R_x(\pi/2) \cdot R_z(\beta) = \frac{1}{\sqrt{2}} \cdot
\left[\begin{matrix}e^{0.5 i \left(- \alpha - \beta\right)} & - 1.0 i e^{- 0.5 i \left(\alpha - \beta\right)}\\- 1.0 i e^{0.5 i \left(\alpha - \beta\right)} & e^{0.5 i \left(\alpha + \beta\right)}\end{matrix}\right]
$$

Hence setting $\alpha = \beta = \pi/2$ and $\phi = \pi/2$ we get

$$
H = e^{i\pi/2} \cdot R_z(\pi/2)\cdot R_x(\pi/2) \cdot R_z(\pi/2)
$$

*** Solution
This is easy to see from the following calculation:

#+name: exercise-4.5-1
#+begin_src python :tangle no :results replace :exports both :cache yes
  nx, ny, nz = sp.symbols('n_x n_y n_z')
  r = nx*X + ny*Y + nz*Z

  sp.simplify(r*r)
#+end_src

#+RESULTS[c8089cdc19c46b97cbd1da49ec29c9545b43b906]: exercise-4.5-1
: Matrix([[n_x**2 + n_y**2 + n_z**2, 0], [0, n_x**2 + n_y**2 + n_z**2]])

By assumption we have $n_x^2 + n_y^2 + n_z^2 = 1$, which implies the claim.

Alternatively one can avoid calculating with matrices by using the well known (anti) commutator
relations between the Pauli Operators like $XY=iZ=-YX$. This shows that in the expanded form of
$(\hat{n}\cdot\sigma)^2$ only the squares of the Pauli Operators survive. Now use $X^2=Y^2=Z^2=I$ to
obtain the claim.

**** (F) The angle in (E) is indeed $\hat{n}$.

PROOF: We have to show that the positive eigenvector $v_+$ of $R_{\hat{n}(\alpha)}$ corresponds to
$\hat{n}$ on the Bloch sphere. Therefore let us calculate the eigenvalues:

#+name: exercise-4.6
#+begin_src python :tangle no :results replace :cache yes
  x, y, z = sp.symbols('x y z')
  N = Matrix([[z, x - I*y], [x + I*y, -z]])
  ev = N.eigenvects()

  # Keep in mind that x^2 + y^2 + z^2 = 1
  output=""
  for i in [0, 1]:
      output += f"eigenvalue = {ev[i][0]}\neigenvector = {ev[i][2]}"
      if i==0: output += "\n\n"
  output
#+end_src

#+RESULTS[2ce8f9af89e7a452fb8bdc1bd2c30601eba34dd4]: exercise-4.6
: eigenvalue = -sqrt(x**2 + y**2 + z**2)
: eigenvector = [Matrix([
: [z/(x + I*y) - sqrt(x**2 + y**2 + z**2)/(x + I*y)],
: [                                               1]])]
:
: eigenvalue = sqrt(x**2 + y**2 + z**2)
: eigenvector = [Matrix([
: [z/(x + I*y) + sqrt(x**2 + y**2 + z**2)/(x + I*y)],
: [                                               1]])]

We see that the normalized eigenvectors for $\pm 1$ are:

$$
  v_{\pm} = \frac{1}{\sqrt{2}} \left(
    \pm \sqrt{1 \pm z}\cdot|0\rangle + \frac{x + iy}{\sqrt{1 \pm z}} \cdot |1\rangle \right)
$$

Let $\theta,\varphi$ such that

$$
  \hat{n} =: (\sin\theta \cos\varphi,\; \sin\theta \sin\varphi,\; \cos\theta)
$$

Let us abbreviate $c=\cos(\theta/2)$, $s=\sin(\theta/2)$. By the usual trigonometric identities we have:

$$
  \hat{n} = (2sc\cos(\varphi), 2sc\sin(\varphi), c^2 - s^2)
$$

Plugging this into the above formula for $v_+$ we see that indeed

$$ |\psi\rangle = c |0\rangle + e^{i\varphi}s |1\rangle $$

which proofs the claim. QED.

*** Proof
We only proof the first assertion since the second one follows trivially from the first.

We use the previously established fact that the 3D-rotations are isomorphic to the Pauli rotation
operators (exercise 4.6). Along that way we essentially establish the relation between Quaternions
and 3D rotations (and Pauli rotations).

For a vector $\hat{n}$ let us define $N_{\hat{n}}=-i(n_1X+n_2Y+n_3Z)$. The composition of the two
rotations is given by:

$$
  (c_{12} + s_{12} N_{\hat{n}_{12}}) = (c_2 + s_2 N_{\hat{n}_2}) \cdot (c_1 + s_1 N_{\hat{n}_1}) .
$$

To spare us from the tedious work to expand the RHS by hand we use sympy for that. We are only
interested in algebraic operations and in particular we don't want to see any cumbersome matrix
expression. To help sympy we use the fact that the Quaternions can be modelled by the Pauli
Matrices. Just use the Identity matrix as the unit (the real number 1) and $-iX$, $-iY$, $-iZ$ as
the three imaginary units. Keep in mind that we only use the Quaternions as a trick to tell sympy
that we are not interested in Matrices. Essentially we still use the Pauli Rotations to prove the
claim.

#+name: exercise-4.15
#+begin_src python :tangle no :results replace :cache yes
  x1, y1, z1 = sp.symbols('x1 y1 z1')
  x2, y2, z2 = sp.symbols('x2 y2 z2')
  c1, c2, s1, s2 = sp.symbols('c1 c2 s1 s2')

  N1 = Quaternion(0, x1, y1, z1)
  N2 = Quaternion(0, x2, y2, z2)

  R1 = c1 + s1*N1
  R2 = c2 + s2*N2

  result = R2 * R1

  # Formatting for readability:
  str(result).replace(' + (', '\n+ (')
#+end_src

#+RESULTS[90550c79075fc9e8ac6de316f753c23ac8078090]: exercise-4.15
: (c1*c2 - s1*s2*x1*x2 - s1*s2*y1*y2 - s1*s2*z1*z2)
: + (c1*s2*x2 + c2*s1*x1 - s1*s2*y1*z2 + s1*s2*y2*z1)*i
: + (c1*s2*y2 + c2*s1*y1 + s1*s2*x1*z2 - s1*s2*x2*z1)*j
: + (c1*s2*z2 + c2*s1*z1 - s1*s2*x1*y2 + s1*s2*x2*y1)*k

From here we can directly read out the claim! QED.

*** Solution
Since the exercise already speaks about permutations lets dive into the permutation group
formalism. This works since all involved matrices (=CNOT=, Toffoli, and the matrix from the exercise
text) are all /permutation matrices/. These form a group which is isomorphic to a group of
permuations. The procedure below also works analogously if we would directly use the matrix
representations but I think it is nice to think it throught in a different formalism.

Keep in mind that the isomorphism reverses the order of multiplication, that is: if Matrices $A$ and
$B$ correspond to permutations $a$ and $b$ then $AB$ corresponds to $ba$ (meaning apply $b$ first
and then $a$). This is not just a sympy quirk but a normal convention in the mathematics of
permutations. Maybe the rationale is that the action of a permutation is sometimes written in
superscript notation: $x^{ba}=(x^b)^a$ where $x$ is some set which gets permutated (see also
[[https://en.wikipedia.org/wiki/Group_action#Right_group_action][right-group-action]] on wikipedia, which does not use superscript notation though).

Recall the Matrix representation for the =CNOT= gate with control at 0 and target at 1 (on three
wires):

$$
  C_{01}(X) = \begin{bmatrix}
      1 & 0 & 0 & 0 & 0 & 0 & 0 & 0 \\
      0 & 1 & 0 & 0 & 0 & 0 & 0 & 0 \\
      0 & 0 & 1 & 0 & 0 & 0 & 0 & 0 \\
      0 & 0 & 0 & 1 & 0 & 0 & 0 & 0 \\
      0 & 0 & 0 & 0 & 0 & 0 & 1 & 0 \\
      0 & 0 & 0 & 0 & 0 & 0 & 0 & 1 \\
      0 & 0 & 0 & 0 & 1 & 0 & 0 & 0 \\
      0 & 0 & 0 & 0 & 0 & 1 & 0 & 0
    \,\end{bmatrix}
$$

If we enumerate the basis vectors from $0$ (for $|000\rangle$) to $7$ (for $|111\rangle$), then this
corresponds to the permuation $(4\;6)(5\;7)$ (in [[https://en.wikipedia.org/wiki/Permutation#Cycle_notation][cycle-notation]]). The other variations of =CX= (with
different control/target) can be found by noting that permuting the three wires induces a
permutation on the basis vectors which in turn translates to an action on the permutation group
itself. See the code block below for the results (or use ~make_CU~ to make life easier).

The "standard" Toffoli Gate is the one with target at 2:

$$
  T_2 = \begin{bmatrix}
      1 & 0 & 0 & 0 & 0 & 0 & 0 & 0 \\
      0 & 1 & 0 & 0 & 0 & 0 & 0 & 0 \\
      0 & 0 & 1 & 0 & 0 & 0 & 0 & 0 \\
      0 & 0 & 0 & 1 & 0 & 0 & 0 & 0 \\
      0 & 0 & 0 & 0 & 1 & 0 & 0 & 0 \\
      0 & 0 & 0 & 0 & 0 & 1 & 0 & 0 \\
      0 & 0 & 0 & 0 & 0 & 0 & 0 & 1 \\
      0 & 0 & 0 & 0 & 0 & 0 & 1 & 0
  \,\end{bmatrix} ,
$$

which corresponds to the permuation $(6\;7)$. The other three Toffolis (with different targets) are
listed in the code block below.

#+name: exercise-4-27-1
#+begin_src python
  # cx3ij means: control i, target j
  cx301 = Perm(4, 6)(5, 7)
  cx302 = Perm(4, 5)(6, 7)
  cx312 = Perm(2, 3)(6, 7)
  cx310 = Perm(2, 6)(3, 7)
  cx320 = Perm(1, 5)(3, 7)
  cx321 = Perm(1, 3)(5, 7)

  # t3i means: target at qubit i
  t30 = Perm(3, 7)
  t31 = Perm(5, 7)
  t32 = Perm(6, 7)
#+end_src

The following code defines an exhaustive search for solutions with a fixed number of gates.

#+name: exercise-4-27-2
#+begin_src python
  def search_ex4_27(n: int):
      """Find all solutions to exercise 4.27 with n gates."""
      perms = [cx301, cx302, cx312, cx310, cx320, cx321, t30, t31, t32]
      names = ["cx301", "cx302", "cx312", "cx310", "cx320", "cx321", "t30", "t31", "t32"]
      indices = list(range(len(perms)))

      for idxs in product(*([indices]*n)):
          ps = [perms[i] for i in idxs]
          prod = reduce((lambda x, y: x*y), ps)
          if prod == Perm(1, 2, 3, 4, 5, 6, 7):
              print(" * ".join([names[i] for i in idxs]))
#+end_src

Trying out some values of $n$ we see that $n=5$ is the minimal value which yields a solution. There
are six solutions in fact but they are similar in the sense that the last three permutations (gates)
actually commute. The solutions are:

#+name: exercise-4-27-2-compute
#+begin_src python :results replace output :tangle no :cache yes
  search_ex4_27(5)
#+end_src

#+RESULTS[a65c15f9a713a9f7fcb1ba280f92ffc23c94e7a3]: exercise-4-27-2-compute
: t30 * cx321 * cx302 * cx312 * t32
: t30 * cx321 * cx302 * t32 * cx312
: t30 * cx321 * cx312 * cx302 * t32
: t30 * cx321 * cx312 * t32 * cx302
: t30 * cx321 * t32 * cx302 * cx312
: t30 * cx321 * t32 * cx312 * cx302

One benefit of the "reversed" multiplication of the permutations is that it is the same ordering
like in typical drawings of circuits. Let us just draw the third one:

#+RESULTS[443d6bed5a602328d4d4dc9fe85075998a4e0e86]: exercise-4-27-circuit

#+name: exercise-4-27-circuit
#+begin_src python :results replace :exports results :tangle no :cache yes
p  qc = QuantumCircuit(3)
  qc.ccx(1, 2, 0)
  qc.cx(2, 1)
  qc.cx(1, 2)
  qc.cx(0, 2)
  qc.ccx(0, 1, 2)

  qc.draw('text')
#+end_src

** Exercise 4.33 (Measurement in the Bell basis)
The measurement model we have specified for the quantum circuit model is that measurements are
performed only in the computational basis. However, often we want to perform a measurement in some
other basis, defined by a complete set of orthonormal states. To perform this measurement, simply
unitarily transform from the basis we wish to perform the measurement in to the computational basis,
then measure. For example, show that the circuit

#+name: exercise-4.33-bell-measurement
#+begin_src python :results replace :exports results :tangle no :cache yes
  qc = QuantumCircuit(2, 2)
  qc.cx(0, 1)
  qc.h(0)
  qc.barrier(range(2)) # just to make the drawing nicer
  qc.measure(range(2), range(2))

  qc.draw('text')
#+end_src

#+RESULTS[21d6c0ad5fa014c21c4f5d6a1c61f8f94747be78]: exercise-4.33-bell-measurement
:           ┌───┐ ░ ┌─┐
: q_0: ──■──┤ H ├─░─┤M├───
:      ┌─┴─┐└───┘ ░ └╥┘┌─┐
: q_1: ┤ X ├──────░──╫─┤M├
:      └───┘      ░  ║ └╥┘
: c: 2/══════════════╩══╩═
:                    0  1

performs a measurement in the basis of the Bell states. More precisely, show that
this circuit results in a measurement being performed with corresponding
POVM elements the four projectors onto the Bell states. What are the
corresponding measurement operators?

** Exercise 4.34 (Measuring an operator)
Suppose we have a single qubit operator $U$ with eigenvalues $\pm1$, so that $U$ is both Hermitian and
unitary, so it can be regarded both as an observable and a quantum gate. Suppose we wish to measure
the observable $U$. That is, we desire to obtain a measurement result indicating one of the two
eigenvalues, and leaving a post-measurement state which is the corresponding eigenvector. How can
this be implemented by a quantum circuit?  Show that the following circuit implements a measurement
of $U$:

#+name: exercise-4.34-measure-observable
#+begin_src python :results replace :exports results :tangle no :cache yes
  qc = QuantumCircuit(QuReg(1, "anc"), QuReg(1, "psi"), ClReg(1, "c"))

  qc.initialize('0', [0])
  qc.barrier()

  qc.h(0)
  CU = ControlledGate("CU", 2, [], base_gate=Gate("U", 1, []))
  qc.append(CU, [0, 1])
  qc.h(0)
  qc.barrier(range(2)) # just to make the drawing nicer
  qc.measure(range(1), range(1))

  qc.draw('text')
#+end_src

#+RESULTS[a1ef0b899752e32561824fa277bb16807008fd8b]: exercise-4.34-measure-observable
:      ┌───────────────┐ ░ ┌───┐     ┌───┐ ░ ┌─┐
: anc: ┤ Initialize(0) ├─░─┤ H ├──■──┤ H ├─░─┤M├
:      └───────────────┘ ░ └───┘┌─┴─┐└───┘ ░ └╥┘
: psi: ──────────────────░──────┤ U ├──────░──╫─
:                        ░      └───┘      ░  ║
: c: 1/═══════════════════════════════════════╩═
:                                             0

*** Solution
Let us call the matrix $M$. Clearly $M$ represents a two-level operation at $s=010$, $t=111$. The
following gray code connects the two bit-patterns:

| $g_1$ | 010 |
| $g_2$ | 011 |
| $g_3$ | 111 |

Let $P$ be the permutation matrix corresponding to the permuation $(7)(2,3)$ in cycle notation (it
swaps $|g_1\rangle$ and $|g_2\rangle$). It can be implemented by a controlled =X=. $PMP$ is a
controlled $\tilde{U}$ gate with target $0$ and controls at all remaining wires. Hence the following
circuit implements $M$:

#+name: exercise-4.39-1
#+begin_src python :results replace :exports results :tangle no :cache yes
  qcU = QuantumCircuit(1, name="Ũ")
  ccu = qcU.to_gate().control(2)

  qc = QuantumCircuit(3)
  qc.ccx(0, 1, 2, '10')  # note: qiskit uses different bit-order
  qc.append(ccu, [1, 2, 0])
  qc.ccx(0, 1, 2, '10')

  qc.draw('text')
#+end_src

#+RESULTS[eb4210adecd1798cc21018704c3420b045df2096]: exercise-4.39-1
:           ┌───┐
: q_0: ──o──┤ Ũ ├──o──
:        │  └─┬─┘  │
: q_1: ──■────■────■──
:      ┌─┴─┐  │  ┌─┴─┐
: q_2: ┤ X ├──■──┤ X ├
:      └───┘     └───┘

Figure 4.9 shows how to implement the controlled =X= from fundamental gates (take also into account
the "trick" from Figure 4.11). Use Figure 4.8 and Figure 4.6 to implement the controlled
$\tilde{U}$.

*** Proofs
Let us first prove formula (1) - because it is the simplest. In fact, it directly follows from first
order approximating all involved exponential series:

$$
  e^{(A+B)t} = I + (A+B)t + O(t^2) = e^{At} e^{Bt} + O(t^2) .
$$

*Remark:* From this we easily obtain the Trotter Formula (Theorem 4.3) by replacing
$t\,\leftarrow\,t/n$ and taking the $n$​-th power. We even get a uniform error estimate $O(1/n)$ if
$t$ is restricted to a fixed interval $[0,t_0]$. Of course the original proof shows the same
(including the error estimate), but it contains an error: It is not true that
$\binom{n}{k}/n^k=(1+O(1/n))/k!$. Set $k=n$ to see this.

The other two formulas are also showed by comparing power series. This rather boring task can be
done by =sympy=. Hence let us define three symbols. Two non-commuting symbols for the operators and
a commuting symbol for the time:

#+name: exercise-4.49-1
#+begin_src python :tangle no
  A, B = sp.symbols('A B', commutative=False)
  t = sp.symbols('t', commutative=True)  # commutes with A and B
#+end_src

For a warm up let us return to formula (1):

#+name: exercise-4.49-2
#+begin_src python :results replace :tangle no :cache yes
  E1 = exp((A+B)*t) - exp(A*t)*exp(B*t)
  E1.series(t, 0, 3)
#+end_src

#+RESULTS[85f5c2f185c70bdc5250c320376de27fd6a9a142]: exercise-4.49-2
: t**2*(-A*B/2 + B*A/2) + O(t**3)

This of course shows the claim again. But it is slightly more precise. The $t^2$ term as the
coefficient $-[A,B]/2$. In a sense this already proves the BCH formula (since the exponential's
leading term is $I$). But let us check it anyway. We increase the order of the series expansion to
$4$ since we are curious what the first non-vanishing term looks like:

#+name: exercise-4.49-3
#+begin_src python :results replace :tangle no :cache yes
  E2 = exp((A+B)*t) - exp(A*t)*exp(B*t)*exp(-(A*B-B*A)*t**2/2)
  E2.series(t, 0, 4)
#+end_src

#+RESULTS[1a4fc04ca84f4667100669ebfe9fb1a6c5f06b41]: exercise-4.49-3
: t**3*(-A*B*A/3 - A*B**2/3 + A**2*B/6 + 2*B*A*B/3 + B*A**2/6 - B**2*A/3) + O(t**4)

Now let us check formula (2):

#+name: exercise-4.49-4
#+begin_src python :results replace :tangle no :cache yes
  E3 = exp((A+B)*t) - exp(B*t/2)*exp(A*t)*exp(B*t/2)
  E3.series(t, 0, 4)
#+end_src

#+RESULTS[2eab52cd65ebe6327b2d8dcbdd8e2beb97fec2ed]: exercise-4.49-4
: t**3*(A*B*A/6 + A*B**2/24 - A**2*B/12 - B*A*B/12 - B*A**2/12 + B**2*A/24) + O(t**4)

Comparing this with the third order term of the BCH formula it looks like this formula has a
slightly better error estimate (the coefficients are smaller). But this is speculation at this
point!

QED.

